БухЭксп/DataProcessors/ПомощникПереходаСУСННаОСНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПомощникПереходаСУСННаОСНО</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПерехода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

БухЭксп/Enums/ВидыОперацийПереходаСУСННаОСНО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПереходаСУСННаОСНО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковПоОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковПоНМА</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодготовкаКВычетуНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводДоходовПереходногоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводРасходовПереходногоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОстатковПоНалоговомуУчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОповещениеФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверкаНДСВДокументахРеализации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/DataProcessors/ПомощникПереходаСУСННаОСНО/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжиданияАктуализации Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Организация.Пустая() Тогда
		Объект.Организация = Параметры.Организация;
	Иначе
		Объект.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	КонецЕсли;
	ОрганизацияПредставление = Объект.Организация;
	
	Если ЗначениеЗаполнено(Параметры.ДатаПерехода) Тогда
		Объект.ДатаПерехода = Параметры.ДатаПерехода;
	Иначе
		ДатыПерехода = Обработки.ПомощникПереходаСУСННаОСНО.ДатыПереходаСУСННаОСНО(Объект.Организация);
		Объект.ДатаПерехода = АктуальнаяДатаПерехода(ДатыПерехода);
	КонецЕсли;
	
	ЭтоВынужденныйПереход = Объект.ДатаПерехода <> КонецГода(Объект.ДатаПерехода);
	
	БылПереходСУСННаОСНО = ЗначениеЗаполнено(Объект.ДатаПерехода);
	
	ДоступностьКнопок = ПравоДоступа("Редактирование", Метаданные.Документы.ВводНачальныхОстатков)
		И ПравоДоступа("Редактирование", Метаданные.Документы.ОперацияБух);
	
	ОбъектМетаданных = Метаданные.Обработки.Найти("ПодготовкаКВычетуНДСУчтенногоВСтоимости");
	ДоступенПомощникПодготовкиКВычетуНДС =
		(ОбъектМетаданных <> Неопределено) И ПравоДоступа("Использование", ОбъектМетаданных);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	БухгалтерскийУчетКлиентПереопределяемый.ОбработкаОповещенияАктуализации(
		ЭтотОбъект, Объект.Организация, КонецДня(Объект.ДатаПерехода), ИмяСобытия, Параметр, Источник);
	
	АктуализацияЗавершенаУспешно = ИмяСобытия = "АктуализацияЗавершенаУспешно";
	ЗаписаноУведомлениеФНС = ИмяСобытия = РегламентированнаяОтчетностьКлиент.ИмяСобытияЗаписьУведомления();
	ПодготовкаКВычетуНДСВводОстатков = ИмяСобытия = "ПодготовкаКВычетуНДСВводОстатков";
	
	Если АктуализацияЗавершенаУспешно Или ЗаписаноУведомлениеФНС Или ПодготовкаКВычетуНДСВводОстатков Тогда
		Организация = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметр, "Организация");
		Если Организация <> Неопределено И Организация = Объект.Организация Тогда
			ПолучитьДанныеПоОперациям(Ложь);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если БылПереходСУСННаОСНО Тогда
		ПолучитьДанныеПоОперациям(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СкрытьНажатие(Элемент)
	
	БухгалтерскийУчетКлиентПереопределяемый.СкрытьПанельАктуализации(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаДоходыНажатие(Элемент)
	
	ОткрытьФормуРасшифровки("Доход");
	
КонецПроцедуры

&НаКлиенте
Процедура СуммаРасходыНажатие(Элемент)
	
	ОткрытьФормуРасшифровки("Расход");
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ДатыПерехода = ДатыПерехода(Объект.Организация);
	Объект.ДатаПерехода = АктуальнаяДатаПерехода(ДатыПерехода);
	БылПереходСУСННаОСНО = ЗначениеЗаполнено(Объект.ДатаПерехода);
	
	ОбновитьРеквизиты(Объект.ДатаПерехода);
	
	Если БылПереходСУСННаОСНО Тогда
		ПолучитьДанныеПоОперациям(Истина);
	Иначе
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьПериодНажатие(Элемент)
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ВыборПериодаЗавершение", ЭтотОбъект), ДатыПерехода);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Актуализировать(Команда)
	
	БухгалтерскийУчетКлиентПереопределяемый.Актуализировать(
		ЭтотОбъект, Объект.Организация, КонецДня(Объект.ДатаПерехода));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьАктуализацию(Команда)
	
	БухгалтерскийУчетКлиентПереопределяемый.ОтменитьАктуализацию(
		ЭтотОбъект, Объект.Организация, КонецДня(Объект.ДатаПерехода));
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНачальныеОстаткиПоОС(Команда)
	
	ВвестиНачальныеОстаткиПоВнеоборотнымАктивам();
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиНачальныеОстаткиПоНМА(Команда)
	
	ВвестиНачальныеОстаткиПоВнеоборотнымАктивам("НМА");
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиОстаткиПоНалоговомуУчету(Команда)
	ВвестиОстаткиПоНалоговомуУчетуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВводНачальныхОстатковПоОССозданныеДокументы(Команда)
	
	РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.ОсновныеСредства");
	ОткрытьСозданныеДокументыВводаОстатков(РазделУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводНачальныхОстатковПоНМАСозданныеДокументы(Команда)
	
	РазделУчета = ПредопределенноеЗначение("Перечисление.РазделыУчетаДляВводаОстатков.НематериальныеАктивыИНИОКР");
	ОткрытьСозданныеДокументыВводаОстатков(РазделУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ПомощникПодготовкиКВычетуНДС(Команда)
	
	ДатаНачалаПримененияОСНО = КонецДня(Объект.ДатаПерехода) + 1;
	
	ПараметрыПомощника = Новый Структура;
	ПараметрыПомощника.Вставить("Организация", Объект.Организация);
	ПараметрыПомощника.Вставить("Период", ДатаНачалаПримененияОСНО);
	ПараметрыПомощника.Вставить("ЭтоПереходСУСННаОСНО", Истина);
	ОткрытьФорму("Обработка.ПодготовкаКВычетуНДСУчтенногоВСтоимости.Форма.ОсновнаяФорма", ПараметрыПомощника);
	
КонецПроцедуры

&НаКлиенте
Процедура ВводОстатковПоНУСозданныеДокументы(Команда)
	
	ОткрытьСозданныеДокументыВводаОстатков();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаВводОстатковПоОС(Команда)
	
	ОткрытьФорму("Отчет.АнализСубконто.Форма.ФормаОтчета",
		ПараметрыОтчета("АнализСубконто", "ОС"),
		ЭтотОбъект,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаВводОстатковПоНМА(Команда)
	
	ОткрытьФорму("Отчет.АнализСубконто.Форма.ФормаОтчета",
		ПараметрыОтчета("АнализСубконто", "НМА"),
		ЭтотОбъект,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаВводОстатковПоНУ(Команда)
	
	ОткрытьФорму("Отчет.ОборотноСальдоваяВедомость.Форма.ФормаОтчета",
		ПараметрыОтчета("ОборотноСальдоваяВедомость"),
		ЭтотОбъект,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаНДСВДокументахРеализации(Команда)
	
	ОткрытьФормуРасшифровки("НДСВДокументахРеализации");
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьДоходы(Команда)
	
	ОтразитьДоходыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтразитьРасходы(Команда)
	ОтразитьРасходыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СозданныеДокументы(Команда)
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Дата", Объект.ДатаПерехода + 1);
	ПараметрыОтбора.Вставить("Организация", Объект.Организация);
	ПараметрыОтбора.Вставить("ПометкаУдаления", Ложь);
	
	ПараметрыФормы = Новый Структура("Отбор", ПараметрыОтбора);
	
	ОткрытьФорму("Документ.ОперацияБух.Форма.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьДанныеПоОперациям(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПодготовитьСообщениеВФНС(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	
	ТекущаяДата = ОбщегоНазначенияКлиент.ДатаСеанса();
	НачалоПримененияЕдиногоУведомления = УчетУСНКлиентСервер.ДатаНачалаПримененияЕдиногоУведомленияУСН();
	ПрименяетсяЕдиноеУведомлениеУСН = ТекущаяДата >= НачалоПримененияЕдиногоУведомления;
	
	Если ПрименяетсяЕдиноеУведомлениеУСН Тогда
		
		ПараметрыЗаполнения = ПараметрыЗаполненияЕдиногоУведомления();
		ПараметрыФормы.Вставить("СформироватьФормуОтчетаАвтоматически", Истина);
		ПараметрыФормы.Вставить("ПараметрыЗаполнения", ПараметрыЗаполнения);
		
		ИмяФормыУведомления = ПолноеИмяФормыУведомления("РегламентированноеУведомлениеУСН");
		ОткрытьФорму(ИмяФормыУведомления, ПараметрыФормы);
		
	Иначе
		
		Если ЭтоВынужденныйПереход Тогда
			ИмяОтчета = "РегламентированноеУведомлениеУтратаПраваУСН";
		Иначе
			ИмяОтчета = "РегламентированноеУведомлениеОтказОтУСН";
		КонецЕсли;
		
		ИмяФормыУведомления = ПолноеИмяФормыУведомления(ИмяОтчета);
		ОткрытьФорму(ИмяФормыУведомления, ПараметрыФормы);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НаписатьРазработчикам(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена", ЭтотОбъект);
	РаботаСПочтовымиСообщениямиКлиент.ПроверитьНаличиеУчетнойЗаписиДляОтправкиПочты(ОписаниеОповещения);
	
КонецПроцедуры

#Область ИзменитьСтатусОперации

&НаКлиенте
Процедура ИзменитьСтатусОС(Команда)
	ИзменитьСтатус("ВводНачальныхОстатковПоОС");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусНМА(Команда)
	ИзменитьСтатус("ВводНачальныхОстатковПоНМА");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусНДС(Команда)
	ИзменитьСтатус("ПодготовкаКВычетуНДС");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусВводОстатковПоНУ(Команда)
	ИзменитьСтатус("ВводОстатковПоНалоговомуУчету");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусДоходы(Команда)
	ИзменитьСтатус("ВводДоходовПереходногоПериода");
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСтатусРасходы(Команда)
	ИзменитьСтатус("ВводРасходовПереходногоПериода");
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьАктуальность()
	
	БухгалтерскийУчетКлиентПереопределяемый.ПроверитьАктуальность(
		ЭтотОбъект, Объект.Организация, КонецДня(Объект.ДатаПерехода));
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеАктуализации()
	
	БухгалтерскийУчетКлиентПереопределяемый.ПроверитьВыполнениеАктуализацииОтчета(
		ЭтотОбъект, Объект.Организация, КонецДня(Объект.ДатаПерехода));

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьЗавершениеАктуализации()
	
	БухгалтерскийУчетКлиентПереопределяемый.ПроверитьЗавершениеАктуализации(
		ЭтотОбъект, Объект.Организация, КонецДня(Объект.ДатаПерехода));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АктуальнаяДатаПерехода(ДатыПерехода)
	
	ДатаПерехода = '00010101';
	
	Если ДатыПерехода.Количество() = 0 Тогда
		Возврат ДатаПерехода;
	КонецЕсли;
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ЭлементТекущийГод = ДатыПерехода.НайтиПоЗначению(КонецГода(ТекущаяДата));
	ЭлементПрошлыйГод = ДатыПерехода.НайтиПоЗначению(НачалоГода(ТекущаяДата) - 1);
	
	Если ЭлементТекущийГод <> Неопределено Тогда
		ДатаПерехода = ЭлементТекущийГод.Значение;
	ИначеЕсли ЭлементПрошлыйГод <> Неопределено Тогда
		ДатаПерехода = ЭлементПрошлыйГод.Значение;
	Иначе
		ДатаПерехода = ДатыПерехода[ДатыПерехода.Количество() - 1].Значение;
	КонецЕсли;
	
	Возврат ДатаПерехода;
	
КонецФункции

&НаКлиенте
Процедура ВыборПериодаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьРеквизиты(ВыбранныйЭлемент.Значение);
	
	Если БылПереходСУСННаОСНО Тогда
		ПолучитьДанныеПоОперациям(Истина);
	Иначе
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРеквизиты(ДатаПерехода)
	
	Объект.ДатаПерехода = ДатаПерехода;
	БылПереходСУСННаОСНО = ЗначениеЗаполнено(Объект.ДатаПерехода);
	ПараметрыФункции = НовыйПараметрыВыполнения();
	ДлительнаяОперация = ДанныеПоОперациям(ПараметрыФункции, УникальныйИдентификатор);
	ЭтоВынужденныйПереход = ДатаПерехода <> КонецГода(ДатаПерехода);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	БылПереходСУСННаОСНО = Форма.БылПереходСУСННаОСНО;
	ДанныеПоОперациям = Форма.ДанныеПоОперациям;
	ДоступностьКнопок = Форма.ДоступностьКнопок;
	
	НастроитьОтображениеШапки(Форма);
	
	Если Не БылПереходСУСННаОСНО Или ДанныеПоОперациям = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастроитьОтображениеГруппыОповещениеФНС(Форма);
	НастроитьОтображениеГруппыВнеоборотныхАктивов(Элементы, ДанныеПоОперациям, "ОС");
	НастроитьОтображениеГруппыВнеоборотныхАктивов(Элементы, ДанныеПоОперациям, "НМА");
	НастроитьОтображениеГруппыНДС(Элементы, ДанныеПоОперациям, Форма.ДоступенПомощникПодготовкиКВычетуНДС);
	НастроитьОтображениеГруппыДоходыРасходы(Элементы, ДанныеПоОперациям, "Доходы");
	НастроитьОтображениеГруппыВводОстатковПоНУ(Элементы, ДанныеПоОперациям);
	НастроитьОтображениеГруппыДоходыРасходы(Элементы, ДанныеПоОперациям, "Расходы");
	НастроитьОтображениеГруппыНДСВДокументахРеализации(Элементы, ДанныеПоОперациям, Форма.ЭтоВынужденныйПереход);
	
	Элементы.ВвестиОстаткиПоНалоговомуУчету.Доступность = ДоступностьКнопок;
	Элементы.ОтразитьДоходы.Доступность = ДоступностьКнопок;
	Элементы.ОтразитьРасходы.Доступность = ДоступностьКнопок;
	
КонецПроцедуры

#Область НастройкиОтображенияЭлементов

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеШапки(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	БылПереходСУСННаОСНО = Форма.БылПереходСУСННаОСНО;
	
	Элементы.ГруппаДоПерехода.Видимость = БылПереходСУСННаОСНО;
	Элементы.ГруппаПослеПерехода.Видимость = БылПереходСУСННаОСНО;
	Элементы.ГруппаСтатусы.Видимость = БылПереходСУСННаОСНО;
	
	Если Форма.ДанныеПоОперациям = Неопределено Тогда
		Элементы.ГруппаОС.Видимость = Ложь;
		Элементы.ГруппаНМА.Видимость = Ложь;
	КонецЕсли;
	
	Если БылПереходСУСННаОСНО Тогда
		
		Элементы.НадписьПодсказка.Заголовок = НСтр(
			"ru = 'Перед началом работы на ОСНО введите начальные остатки и отразите операции переходного периода.'");
		
		ТекстНадписьПериод = НСтр("ru = 'Переход на ОСНО с %1'");
		Элементы.НадписьПериод.Заголовок = СтрШаблон(ТекстНадписьПериод, Формат(Объект.ДатаПерехода + 1, "ДЛФ=DD;"));
		Элементы.НадписьПериод.Гиперссылка = Форма.ДатыПерехода.Количество() > 1; 
		
		ТекстГруппаДоПерехода = НСтр("ru = 'Подготовка к переходу на ОСНО (выполняется %1)'");
		Элементы.ГруппаДоПерехода.Заголовок = СтрШаблон(ТекстГруппаДоПерехода, Формат(Объект.ДатаПерехода, "ДЛФ=D;"));
		
		ТекстГруппаПослеПерехода = НСтр("ru = 'После перехода на ОСНО  (выполняется %1)'");
		Элементы.ГруппаПослеПерехода.Заголовок = СтрШаблон(ТекстГруппаПослеПерехода,
			Формат(Объект.ДатаПерехода + 1, "ДЛФ=D;"));
		
	Иначе
		
		Элементы.НадписьПодсказка.Заголовок = НСтр(
			"ru = 'Организация не меняла систему налогообложения с УСН на ОСНО, выполнение переходных операций не требуется.'");
		Элементы.НадписьПериод.Заголовок = "";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеГруппыОповещениеФНС(Форма)
	
	Элементы = Форма.Элементы;
	ЭтоВынужденныйПереход = Форма.ЭтоВынужденныйПереход;
	ДанныеПоОперациям = Форма.ДанныеПоОперациям;
	Объект = Форма.Объект;
	
	ДатаПерехода = Объект.ДатаПерехода;
	ДанныеПоОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПоОперациям, "ОповещениеФНС");
	
	Если ДанныеПоОперации = Неопределено Тогда
		Элементы.ГруппаОповещениеФНС.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаОповещениеФНС.Видимость = ДанныеПоОперации.Актуальность;
	Элементы.СтатусОповещениеФНС.Картинка = КартинкаСостоянияОперации(ДанныеПоОперации.Состояние);
	
	Если ЭтоВынужденныйПереход Тогда
		
		Элементы.ТекстОповещениеФНСЗаголовок.Заголовок = НСтр("ru = 'Сообщение об утрате права на применение УСН'");
		Элементы.ПодготовитьСообщениеВФНС.Заголовок = НСтр("ru = 'Подготовить сообщение'");
		
		ТекстОповещениеФНСПодсказка = НСтр("ru = 'До %1 подайте в ФНС сообщение об утрате права на применение УСН. За нарушение сроков предусмотрен штраф.'");
		ДатаОповещения = ДатаОповещенияФНС(КонецКвартала(ДатаПерехода + 1));
		
	Иначе
		
		Элементы.ТекстОповещениеФНСЗаголовок.Заголовок = НСтр("ru = 'Уведомление об отказе от применения УСН'");
		Элементы.ПодготовитьСообщениеВФНС.Заголовок = НСтр("ru = 'Подготовить уведомление'");
		
		ТекстОповещениеФНСПодсказка = НСтр("ru = 'До %1 подайте в ФНС уведомление об отказе от применения УСН. За нарушение сроков предусмотрен штраф.'");
		ДатаОповещения = ДатаОповещенияФНС(ДатаПерехода);
		
	КонецЕсли;
	
	Элементы.ТекстОповещениеФНСПодсказка.Заголовок = СтрШаблон(
		ТекстОповещениеФНСПодсказка, Формат(ДатаОповещения, "ДЛФ=DD;"));
	
	Оповещение = ДанныеПоОперации.Оповещение;
	Если ДанныеПоОперации.Состояние = СостояниеВыполнено()
		Или Оповещение <> Неопределено Тогда
		Элементы.ПодготовитьСообщениеВФНС.Видимость = Ложь;
		ПредставлениеСсылки = СтрШаблон(НСтр("ru = '%1 от %2'"),
			НаименованиеСообщенияВФНС(Форма.ЭтоВынужденныйПереход),
			Формат(ДатаОповещения, "ДФ='dd MMMM yyyy';"));
		НавигационнаяСсылка = ПолучитьНавигационнуюСсылку(Оповещение);
		Элементы.СообщениеВФНС.Заголовок = Новый ФорматированнаяСтрока(
			ПредставлениеСсылки, , , , НавигационнаяСсылка);
		Элементы.СообщениеВФНС.Видимость = Истина;
	Иначе
		Элементы.ПодготовитьСообщениеВФНС.Видимость = Истина;
		Элементы.СообщениеВФНС.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеГруппыВнеоборотныхАктивов(Элементы, ДанныеПоОперациям, Имя)
	
	ИмяГруппа = "Группа" + Имя;
	ИмяСвойства = "ВводНачальныхОстатковПо" + Имя;
	ИмяСвойстваСозданныеДокументы = ИмяСвойства + "СозданныеДокументы";
	ДанныеПоОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПоОперациям, ИмяСвойства);
	
	Если ДанныеПоОперации = Неопределено Тогда
		Элементы[ИмяГруппа].Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ИмяСтатус = "Статус" + Имя;
	ИмяИзменитьСтатус = "ИзменитьСтатус" + Имя;
	
	Элементы[ИмяГруппа].Видимость = ДанныеПоОперации.Актуальность;
	Элементы[ИмяСтатус].Картинка = КартинкаСостоянияОперации(ДанныеПоОперации.Состояние);
	Элементы[ИмяИзменитьСтатус].Заголовок = ЗаголовокКомандыИзменитьСтатус(ДанныеПоОперации.Состояние);
	Элементы[ИмяСвойстваСозданныеДокументы].Видимость = Ложь;
	Элементы[ИмяСвойства].Видимость = ДанныеПоОперации.Состояние <> СостояниеПропущено();
	Элементы[ИмяСвойства].Заголовок = НСтр("ru = 'Перезаполнить остатки'");
	
	Если ДанныеПоОперации.Состояние = СостояниеВыполнено()
		Или ДанныеПоОперации.Состояние = СостояниеВыполненоСОшибками() Тогда
		Элементы[ИмяСвойстваСозданныеДокументы].Видимость = Истина;
	ИначеЕсли ДанныеПоОперации.Состояние = СостояниеНеВыполнено() Тогда
		Элементы[ИмяСвойства].Заголовок = НСтр("ru = 'Ввести остатки'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеГруппыНДС(Элементы, ДанныеПоОперациям, ДоступенПомощникПодготовкиКВычетуНДС)
	
	ДанныеПоОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПоОперациям, "ПодготовкаКВычетуНДС");
	
	Если Не ДоступенПомощникПодготовкиКВычетуНДС Или ДанныеПоОперации = Неопределено Тогда
		Элементы.ГруппаНДС.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаНДС.Видимость = ДанныеПоОперации.Актуальность;
	Элементы.ИзменитьСтатусНДС.Заголовок = ЗаголовокКомандыИзменитьСтатус(ДанныеПоОперации.Состояние);	
	Элементы.СтатусНДС.Картинка = КартинкаСостоянияОперации(ДанныеПоОперации.Состояние);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеГруппыВводОстатковПоНУ(Элементы, ДанныеПоОперациям)
	
	ДанныеПоОперации =
		ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПоОперациям, "ВводОстатковПоНалоговомуУчету");
	
	Если ДанныеПоОперации = Неопределено Тогда
		Элементы.ГруппаВводОстатковПоНУ.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаВводОстатковПоНУ.Видимость = ДанныеПоОперации.Актуальность;
	Элементы.ВводОстатковПоНУ.Картинка = КартинкаСостоянияОперации(ДанныеПоОперации.Состояние);
	Элементы.ИзменитьСтатусВводОстатковПоНУ.Заголовок =
		ЗаголовокКомандыИзменитьСтатус(ДанныеПоОперации.Состояние);
	Элементы.ВводОстатковПоНУСозданныеДокументы.Видимость = Ложь;
	Элементы.ВвестиОстаткиПоНалоговомуУчету.Заголовок = НСтр("ru = 'Перезаполнить остатки'");
	Элементы.ВвестиОстаткиПоНалоговомуУчету.Видимость = ДанныеПоОперации.Состояние <> СостояниеПропущено();
	
	Если ДанныеПоОперации.Состояние = СостояниеВыполнено()
		Или ДанныеПоОперации.Состояние = СостояниеВыполненоСОшибками() Тогда
		Элементы.ВводОстатковПоНУСозданныеДокументы.Видимость = Истина;
	ИначеЕсли ДанныеПоОперации.Состояние = СостояниеНеВыполнено() Тогда
		Элементы.ВвестиОстаткиПоНалоговомуУчету.Заголовок = НСтр("ru = 'Ввести остатки'");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеГруппыДоходыРасходы(Элементы, ДанныеПоОперациям, Имя)
	
	ИмяГруппа = "Группа" + Имя;
	
	Если Имя = "Доходы" Тогда
		ИмяСвойства = "ВводДоходовПереходногоПериода";
	Иначе
		ИмяСвойства = "ВводРасходовПереходногоПериода";
	КонецЕсли;
	ДанныеПоОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПоОперациям, ИмяСвойства);
	
	Если ДанныеПоОперации = Неопределено Тогда
		Элементы[ИмяГруппа].Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ИмяОтразить = "Отразить" + Имя;
	ИмяСозданныеДокументы = "СозданныеДокументы" + Имя;
	ИмяРасшифровка = "Расшифровка" + Имя;
	ИмяСтатус = "Статус" + Имя;
	ИмяИзменитьСтатус = "ИзменитьСтатус" + Имя;
	ТекстПоказателя = НРег(Имя);
	
	Элементы[ИмяГруппа].Видимость = ДанныеПоОперации.Актуальность;
	Элементы[ИмяОтразить].Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Перезаполнить %1'"),
		ТекстПоказателя);
	Элементы[ИмяОтразить].Доступность = Истина;
	Элементы[ИмяОтразить].Видимость = ДанныеПоОперации.Состояние <> СостояниеПропущено();
	Элементы[ИмяСозданныеДокументы].Видимость = Ложь;
	Элементы[ИмяРасшифровка].Заголовок = ЗаголовокСуммы(ДанныеПоОперации.Сумма);
	
	Элементы[ИмяСтатус].Картинка = КартинкаСостоянияОперации(ДанныеПоОперации.Состояние);
	Элементы[ИмяИзменитьСтатус].Заголовок = ЗаголовокКомандыИзменитьСтатус(ДанныеПоОперации.Состояние);
	
	Если ДанныеПоОперации.Состояние = СостояниеВыполнено() Тогда
		Элементы[ИмяСозданныеДокументы].Видимость = Истина;
	ИначеЕсли ДанныеПоОперации.Состояние = СостояниеВыполненоСОшибками() Тогда
		Элементы[ИмяСозданныеДокументы].Видимость = Истина;
	ИначеЕсли ДанныеПоОперации.Состояние = СостояниеНеВыполнено() Тогда
		Элементы[ИмяОтразить].Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отразить %1'"),
			ТекстПоказателя);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОтображениеГруппыНДСВДокументахРеализации(Элементы, ДанныеПоОперациям, ЭтоВынужденныйПереход)
	
	ДанныеПоОперации = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		ДанныеПоОперациям, "ПроверкаНДСВДокументахРеализации");
	Если Не ЭтоВынужденныйПереход Или ДанныеПоОперации = Неопределено Тогда
		Элементы.ГруппаНДСВДокументахРеализации.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаНДСВДокументахРеализации.Видимость = Истина;
	Элементы.СтатусНДСВДокументахРеализации.Картинка = КартинкаСостоянияОперации(ДанныеПоОперации.Состояние);
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПолучитьДанныеПоОперациям(АктуализироватьДанные)
	
	Если ЗначениеЗаполнено(Объект.ДатаПерехода) Тогда
		
		ПараметрыФункции = Новый Структура;
		ПараметрыФункции.Вставить("Организация", Объект.Организация);
		ПараметрыФункции.Вставить("ДатаПерехода", Объект.ДатаПерехода);
		ДлительнаяОперация = ДанныеПоОперациям(ПараметрыФункции, УникальныйИдентификатор);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Выполняется подготовка данных...'");
		ОповещениеЗавершения = Новый ОписаниеОповещения("ПолучитьДанныеПоОперациямЗавершение", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеЗавершения, ПараметрыОжидания);
		
	КонецЕсли;
	
	Если АктуализироватьДанные Тогда
		БухгалтерскийУчетКлиентПереопределяемый.ПроверитьАктуальность(
			ЭтотОбъект, Объект.Организация, КонецДня(Объект.ДатаПерехода));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеПоОперациям(ПараметрыФункции, УникальныйИдентификатор)
	
	// Параметры длительной операции
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания =
		НСтр("ru = 'Получение данных по операциям перехода с УСН на ОСНО'");
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"Обработки.ПомощникПереходаСУСНнаОСНО.ДанныеПоОперациям",
		ПараметрыФункции);
	
КонецФункции

&НаКлиенте
Процедура ПолучитьДанныеПоОперациямЗавершение(Результат, ДопоплнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(, Результат.КраткоеПредставлениеОшибки);
	Иначе
		ДанныеПоОперациям = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ВвестиОстаткиПоНалоговомуУчетуНаСервере()
	
	ПараметрыВыполнения = НовыйПараметрыВыполнения();
	ПараметрыВыполнения.ВидОперации = Перечисления.ВидыОперацийПереходаСУСННаОСНО.ВводОстатковПоНалоговомуУчету;
	
	НачатьТранзакцию();
	
	Попытка
		Обработки.ПомощникПереходаСУСННаОСНО.ВвестиОстаткиПоНалоговомуУчету(ПараметрыВыполнения);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	ДанныеПоОперациям = Обработки.ПомощникПереходаСУСНнаОСНО.ДанныеПоОперациям(ПараметрыВыполнения);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьДоходыНаСервере()
	
	ПараметрыВыполнения = НовыйПараметрыВыполнения();
	ПараметрыВыполнения.ВидОперации = Перечисления.ВидыОперацийПереходаСУСННаОСНО.ВводДоходовПереходногоПериода;
	
	НачатьТранзакцию();
	
	Попытка
		Обработки.ПомощникПереходаСУСННаОСНО.ОтразитьДоходы(ПараметрыВыполнения);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	ДанныеПоОперациям = Обработки.ПомощникПереходаСУСНнаОСНО.ДанныеПоОперациям(ПараметрыВыполнения);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОтразитьРасходыНаСервере()
	
	ПараметрыВыполнения = НовыйПараметрыВыполнения();
	ПараметрыВыполнения.ВидОперации = Перечисления.ВидыОперацийПереходаСУСННаОСНО.ВводРасходовПереходногоПериода;
	
	НачатьТранзакцию();
	
	Попытка
		Обработки.ПомощникПереходаСУСННаОСНО.ОтразитьРасходы(ПараметрыВыполнения);
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	ДанныеПоОперациям = Обработки.ПомощникПереходаСУСНнаОСНО.ДанныеПоОперациям(ПараметрыВыполнения);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьСтатус(ВидОперации)
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеПоОперациям, ВидОперации) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыВыполнения = НовыйПараметрыВыполнения();
	ПараметрыВыполнения.ВидОперации = Перечисления.ВидыОперацийПереходаСУСННаОСНО[ВидОперации];
	
	ДанныеПоОперации = ДанныеПоОперациям[ВидОперации];
	
	Если ДанныеПоОперации.Состояние <> СостояниеПропущено() Тогда
		ДанныеПоОперации.Состояние = СостояниеПропущено();
		Обработки.ПомощникПереходаСУСНнаОСНО.УдалитьРанееСозданныеДокументыПоОперации(ПараметрыВыполнения);
	Иначе
		ДанныеПоОперации.Состояние = СостояниеНеВыполнено();
	КонецЕсли;
	
	ПараметрыВыполнения.Вставить("ДанныеПоОперациям", ДанныеПоОперациям);
	Обработки.ПомощникПереходаСУСНнаОСНО.ОбновитьЗаписиРегистра(ПараметрыВыполнения);
	ДанныеПоОперациям = Обработки.ПомощникПереходаСУСНнаОСНО.ДанныеПоОперациям(ПараметрыВыполнения);
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДатыПерехода(Организация)
	
	Возврат Обработки.ПомощникПереходаСУСННаОСНО.ДатыПереходаСУСННаОСНО(Организация);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокСуммы(Сумма)
	
	ФорматСуммы = "ЧДЦ=2; ЧН='0,00 руб.'; ЧГ=3,0; ЧФ='Ч руб.';";
	Возврат Формат(Сумма, ФорматСуммы);
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуРасшифровки(ВидРасшифровки)
	
	ПараметрыРасшифровки = Новый Структура;
	ПараметрыРасшифровки.Вставить("Организация", Объект.Организация);
	ПараметрыРасшифровки.Вставить("ДатаПерехода", Объект.ДатаПерехода);
	ПараметрыРасшифровки.Вставить("ВидРасшифровки", ВидРасшифровки);
	
	ПараметрыОткрытия = ОбщегоНазначенияБПКлиентСервер.ПараметрыОткрытияФормыСОжиданием();
	ПараметрыОткрытия.Заголовок = НСтр("ru = 'Расшифровка сумм'");
	ПараметрыОткрытия.ИмяФормы = "Обработка.ПомощникПереходаСУСННаОСНО.Форма.ФормаРасшифровка";
	ПараметрыОткрытия.ЗамерПроизводительности = "СозданиеФормыРасшифровкиСуммПереходСУСННаОСНО";
	ПараметрыОткрытия.НавигационнаяСсылка = Неопределено;
	
	ОбщегоНазначенияБПКлиент.ОткрытьФормуСОжиданием(ПараметрыОткрытия, ПараметрыРасшифровки, Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВвестиНачальныеОстаткиПоВнеоборотнымАктивам(РазделУчета = "ОС")
	
	ПараметрыВыполнения = НовыйПараметрыВыполнения();
	
	НачатьТранзакцию();
	
	Попытка
		Если РазделУчета = "ОС" Тогда
			ПараметрыВыполнения.ВидОперации = Перечисления.ВидыОперацийПереходаСУСННаОСНО.ВводНачальныхОстатковПоОС;
			Обработки.ПомощникПереходаСУСННаОСНО.ВвестиОстаткиПоВнеоборотнымАктивам(ПараметрыВыполнения);
		Иначе
			ПараметрыВыполнения.ВидОперации = Перечисления.ВидыОперацийПереходаСУСННаОСНО.ВводНачальныхОстатковПоНМА;
			Обработки.ПомощникПереходаСУСННаОСНО.ВвестиОстаткиПоВнеоборотнымАктивам(ПараметрыВыполнения);
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение ОписаниеОшибки();
	КонецПопытки;
	
	ДанныеПоОперациям = Обработки.ПомощникПереходаСУСНнаОСНО.ДанныеПоОперациям(ПараметрыВыполнения);
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Функция ПараметрыОтчета(ИмяОтчета, ВидВнеоборотногоАктива = Неопределено)
	
	ДатаФормированияОтчета = Объект.ДатаПерехода + 1;
	
	ПользовательскиеНастройкиКомпоновкиДанных = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ДополнительныеСвойства = ПользовательскиеНастройкиКомпоновкиДанных.ДополнительныеСвойства;
	
	ДополнительныеСвойства.Вставить("НачалоПериода", ДатаФормированияОтчета);
	ДополнительныеСвойства.Вставить("КонецПериода", ДатаФормированияОтчета);
	ДополнительныеСвойства.Вставить("Организация", Объект.Организация);
	ДополнительныеСвойства.Вставить("ПоСубсчетам", Истина);
	
	Если ИмяОтчета = "ОборотноСальдоваяВедомость" Тогда
		ДополнительныеСвойства.Вставить("ПоказательБУ", Ложь);
		ДополнительныеСвойства.Вставить("ПоказательНУ", Ложь);
		ДополнительныеСвойства.Вставить("ПоказательСверкаНУ", Истина);
	Иначе
		
		СписокВидовСубконто = Новый СписокЗначений;
		Если ВидВнеоборотногоАктива = "ОС" Тогда
			СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.ОсновныеСредства);
			ПредставлениеГруппировки = НСтр("ru = 'Основные средства'");
		Иначе
			СписокВидовСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.НематериальныеАктивы);
			ПредставлениеГруппировки = НСтр("ru = 'Нематериальные активы'");
		КонецЕсли;
		
		ГруппировкаОтчета = Новый Структура;
		ГруппировкаОтчета.Вставить("Использование", Истина);
		ГруппировкаОтчета.Вставить("Поле", "Субконто1");
		ГруппировкаОтчета.Вставить("Представление", ПредставлениеГруппировки);
		ГруппировкаОтчета.Вставить("ТипГруппировки", 0);
		
		ГруппировкиОтчета = Новый Массив;
		ГруппировкиОтчета.Добавить(ГруппировкаОтчета);
		
		ДополнительныеСвойства.Вставить("ПоказательБУ", Истина);
		ДополнительныеСвойства.Вставить("ПоказательНУ", Истина);
		ДополнительныеСвойства.Вставить("ПоказательСверкаНУ", Ложь);
		ДополнительныеСвойства.Вставить("СписокВидовСубконто", СписокВидовСубконто);
		ДополнительныеСвойства.Вставить("Группировка", ГруппировкиОтчета);
		
	КонецЕсли;
	
	НастройкиРасшифровки = Новый Структура;
	НастройкиРасшифровки.Вставить(ИмяОтчета, ПользовательскиеНастройкиКомпоновкиДанных);
	
	УсловияОтбора = Новый Структура();
	УсловияОтбора.Вставить("НастройкиРасшифровки", НастройкиРасшифровки);
	
	ОбщиеНастройки = Новый Структура();
	ОбщиеНастройки.Вставить("Объект", УсловияОтбора);
	ОбщиеНастройки.Вставить("НастройкиРасшифровки", НастройкиРасшифровки);
	
	АдресХранилища = ПоместитьВоВременноеХранилище(ОбщиеНастройки, Новый УникальныйИдентификатор);
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("ВидРасшифровки", 1);
	ПараметрыОтчета.Вставить("АдресНастроек", АдресХранилища);
	ПараметрыОтчета.Вставить("СформироватьПриОткрытии", Истина);
	ПараметрыОтчета.Вставить("ИДРасшифровки", ИмяОтчета);
	ПараметрыОтчета.Вставить("РежимРасшифровки", Истина);
	
	Возврат ПараметрыОтчета;
	
КонецФункции

&НаСервере
Функция НовыйПараметрыВыполнения()
	
	ПараметрыВыполнения = Новый Структура;
	ПараметрыВыполнения.Вставить("Организация", Объект.Организация);
	ПараметрыВыполнения.Вставить("ДатаПерехода", Объект.ДатаПерехода);
	ПараметрыВыполнения.Вставить("ВидОперации", Перечисления.ВидыОперацийПереходаСУСННаОСНО.ПустаяСсылка());
	
	Возврат ПараметрыВыполнения;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция КартинкаСостоянияОперации(Состояние)
	
	Если Состояние = СостояниеВыполнено() Тогда
		Возврат БиблиотекаКартинок.ВыполненоУспешно;
	ИначеЕсли Состояние = СостояниеВыполненоСОшибками() Тогда
		Возврат БиблиотекаКартинок.ОперацияВыполненаСОшибками;
	ИначеЕсли Состояние = СостояниеПропущено() Тогда
		Возврат БиблиотекаКартинок.ОперацияПропущена;
	Иначе
		Возврат БиблиотекаКартинок.ОперацияРучнаяКорректировка;
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗаголовокКомандыИзменитьСтатус(Состояние)
	
	Если Состояние = СостояниеПропущено() Тогда
		Возврат НСтр("ru = 'Вернуть автоматический статус'");
	Иначе
		Возврат НСтр("ru = 'Пропустить'");
	КонецЕсли;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СостояниеВыполнено()
	Возврат "Выполнено";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СостояниеПропущено()
	Возврат "Пропущено";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СостояниеВыполненоСОшибками()
	Возврат "ВыполненоСОшибками";
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция СостояниеНеВыполнено()
	Возврат "НеВыполнено";
КонецФункции

&НаКлиенте
Процедура ОткрытьСозданныеДокументыВводаОстатков(РазделУчета = Неопределено)
	
	ПараметрыОтбора = Новый Структура("Дата, Организация", Объект.ДатаПерехода, Объект.Организация);
	ПараметрыОтбора.Вставить("ПомощникВводаНачальныхОстатков", Истина);
	
	Если РазделУчета <> Неопределено Тогда
		ПараметрыОтбора.Вставить("РазделУчета", РазделУчета);
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ПараметрыОтбораСписка", ПараметрыОтбора);
	
	ОткрытьФорму("Документ.ВводНачальныхОстатков.ФормаСписка", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьПоЭлектроннойПочтеНастройкаУчетнойЗаписиПредложена(УчетнаяЗаписьНастроена, ДополнительныеПараметры) Экспорт
	
	Если УчетнаяЗаписьНастроена <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПисьма = РаботаСПочтовымиСообщениямиКлиент.ПараметрыОтправкиПисьма();
	ПараметрыПисьма.Получатель = "bp@1c.ru";
	ПараметрыПисьма.Тема = НСтр("ru = 'Отзыв о функциональности ""Помощник перехода с УСН на ОСНО""'");
	
	РаботаСПочтовымиСообщениямиКлиент.СоздатьНовоеПисьмо(ПараметрыПисьма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НаименованиеСообщенияВФНС(ЭтоВынужденныйПереход)
	Если ЭтоВынужденныйПереход Тогда
		Возврат НСтр("ru = 'Прекращение деятельности УСН'");
	Иначе
		Возврат НСтр("ru = 'Отказ от УСН'");
	КонецЕсли;
КонецФункции

&НаСервереБезКонтекста
Функция ДатаОповещенияФНС(Дата)
	
	Возврат СЭДОФСС.БлижайшийРабочийДень(Дата + 15 * 24 * 60 * 60);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолноеИмяФормыУведомления(ИмяОтчета)
	
	Возврат РегламентированнаяОтчетностьБП.ПолноеИмяФормыПоУмолчанию(ИмяОтчета);
	
КонецФункции

&НаСервере
Функция ПараметрыЗаполненияЕдиногоУведомления()
	
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ЭтоПереходНаОСНО", Истина);
	ПараметрыЗаполнения.Вставить("ЭтоВынужденныйПереход", ЭтоВынужденныйПереход);
	ПараметрыЗаполнения.Вставить("ДатаПерехода", Объект.ДатаПерехода);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

#КонецОбласти
